{
  "caseStudies": [
    {
      "id": "corkvision",
      "title": "CorkVision",
      "role": "Founding Product Engineer",
      "period": "Jan 2025 - Nov 2025",
      "context": "Pre-revenue AI startup backed by AWS and NVIDIA needed their entire product built from zero. Joined as the second employee.",
      "built": "Cross-platform web and mobile applications with custom Business Intelligence dashboards, replacing expensive third-party solutions.",
      "decisions": "Wrote over 60% of the production codebase across web, mobile, and our web server. Designed monolithic service architecture for fast iteration. Built custom BI to eliminate AWS QuickSight dependency.",
      "outcome": "Saved $10-15K/month in recurring costs. Shipped to beta wineries. Led weekly client meetings to drive product roadmap.",
      "image": "images/corkvision-wide.webp",
      "technologies": [
        "Flutter",
        "Node.js",
        "Express",
        "AWS",
        "PostgreSQL",
        "Docker",
        "Python"
      ],
      "link": "https://corkvision.com"
    },
    {
      "id": "perfectline",
      "title": "PerfectLine",
      "role": "Founder & Instructor",
      "period": "Oct 2022 - Present",
      "context": "Saw a gap in quality programming education. Built a platform to deliver personalized, project-based C++ courses.",
      "built": "Production web application with personalized curriculum delivery, progress tracking, and student management. Handled 10-15 simultaneous clients.",
      "decisions": "Next.js for fast, SEO-friendly frontend. Firebase for real-time updates and simple auth. Project-based curriculum over theory-heavy approaches.",
      "outcome": "Taught data structures, OOP, and algorithm design. Managed all operations from curriculum planning to billing.",
      "image": "images/perfectline.webp",
      "technologies": ["Next.js", "Tailwind CSS", "Firebase", "C++", "Unity"],
      "link": "https://perfectline.io"
    },
    {
      "id": "luckybeepress",
      "title": "LuckyBeePress",
      "role": "Contractor",
      "period": "Dec 2025 - Jan 2026",
      "context": "Private web development contractor for local letterpress businesses.",
      "built": "Wholesale e-commerce website for local letterpress business client. Implemented a custom checkout flow and payment processing to cut costs.",
      "decisions": "Next.js for fast, SEO-friendly frontend. Firebase for real-time updates and simple auth. Project-based curriculum over theory-heavy approaches.",
      "outcome": "Cut down costs by 20% by using a custom frontend and backend instead of relying on a third-party solution.",
      "image": "images/luckybeepress.webp",
      "technologies": ["Next.js", "Tailwind CSS", "Firebase", "Stripe"],
      "link": "https://luckybeepress.com"
    },
    {
      "id": "bentolabs",
      "title": "BentoLabs",
      "role": "Creator",
      "period": "Ongoing",
      "context": "Noticed I was rebuilding the same foundational architecture for every new product. Created a solution.",
      "built": "Production-ready codebase automation tool with frontend component libraries for Flutter and Next.js, plus two backend options (Deno/Hono and Node/Express).",
      "decisions": "Modular architecture for flexibility. Terraform for infrastructure as code. Auth0 integration for secure, fast auth setup.",
      "outcome": "Saves 3-6 months of development time per new project. Battle-tested across multiple production applications.",
      "image": "images/bentolabs-wide.webp",
      "technologies": [
        "Next.js",
        "Flutter",
        "Node.js",
        "PostgreSQL",
        "AWS",
        "Auth0",
        "Terraform",
        "Docker"
      ],
      "link": "https://github.com/ethanokamura"
    }
  ]
}
